CREATE A CSV FILE FROM PANDAS DATA FRAME

In [7]:
import pandas as pd
data={'Name':['priyang','Aadhya','Krishna','vedant','Prshav','Mittal','Archana'],
     'Marks':[98,89,99,87,90,83,82],
     'Grades':['AA','AB','AA','AB','AC','BA','BB']}
df=pd.DataFrame(data)
df

      Name  Marks Grades
0  priyang     98     AA
1   Aadhya     89     AB
2  Krishna     99     AA
3   vedant     87     AB
4   Prshav     90     AC
5   Mittal     83     BA
6  Archana     82     BB

THIS TABLE OR DATA I CONVERT INTO CSV FILE

In [10]:
import pandas as pd
df.to_csv('filename.csv',index=False)

In [11]:
pwd

'c:\\Users\\gnane\\OneDrive\\ドキュメント\\Pandas'

READ CSV FILE IN PANDAS DATA FRAME

In [12]:
df=pd.read_csv('filename.csv')
df

      Name  Marks Grades
0  priyang     98     AA
1   Aadhya     89     AB
2  Krishna     99     AA
3   vedant     87     AB
4   Prshav     90     AC
5   Mittal     83     BA
6  Archana     82     BB